# Создам расширенный датасет с фичами (лаги, скользящие средние, разобранные свойства товаров, праздники/выходные и признаки рестока).
# Входные данные — тот самый CSV (включая сгенерированные строки до 31.01.2024).
# Сохраню файл /mnt/data/expanded_jan2024.csv и покажу первые 20 строк.

import pandas as pd
import json
from io import StringIO

csv_data = """Article;ProductName;ProductGroup;ProductType;ProductProperties;Date;Sold;Stock
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";01.01.2024;5;45
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";01.01.2024;3;42
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";01.01.2024;1;12
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";02.01.2024;0;12
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";02.01.2024;2;28
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";02.01.2024;4;24
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";03.01.2024;5;23
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";03.01.2024;1;23
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";03.01.2024;0;12
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";04.01.2024;5;18
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";04.01.2024;4;19
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";04.01.2024;1;11
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";05.01.2024;1;17
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";05.01.2024;2;17
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";05.01.2024;0;11
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";06.01.2024;3;14
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";06.01.2024;6;11
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";06.01.2024;2;9
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";07.01.2024;2;12
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";07.01.2024;8;43
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";07.01.2024;1;8
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";08.01.2024;5;7
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";08.01.2024;2;41
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";08.01.2024;0;8
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";09.01.2024;6;31
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";09.01.2024;6;35
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";09.01.2024;2;6
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";10.01.2024;1;30
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";10.01.2024;0;35
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";10.01.2024;1;5
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";11.01.2024;6;24
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";11.01.2024;2;33
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";11.01.2024;2;3
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";12.01.2024;3;21
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";12.01.2024;8;42
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";12.01.2024;0;3
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";13.01.2024;1;20
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";13.01.2024;2;40
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";13.01.2024;1;2
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";14.01.2024;0;20
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";14.01.2024;6;34
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";14.01.2024;0;2
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";15.01.2024;5;25
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";15.01.2024;6;29
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";15.01.2024;3;19
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";16.01.2024;4;21
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";16.01.2024;5;24
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";16.01.2024;2;17
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";17.01.2024;0;21
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";17.01.2024;7;57
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";17.01.2024;0;17
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";18.01.2024;2;19
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";18.01.2024;4;53
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";18.01.2024;1;16
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";19.01.2024;0;19
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";19.01.2024;4;49
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";19.01.2024;2;14
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";20.01.2024;6;33
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";20.01.2024;8;41
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";20.01.2024;0;14
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";21.01.2024;3;30
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";21.01.2024;6;35
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";21.01.2024;2;12
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";22.01.2024;5;25
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";22.01.2024;1;34
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";22.01.2024;1;11
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";23.01.2024;4;21
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";23.01.2024;4;30
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";23.01.2024;0;11
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";24.01.2024;6;37
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";24.01.2024;1;29
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";24.01.2024;0;11
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";25.01.2024;3;34
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";25.01.2024;5;24
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";25.01.2024;2;9
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";26.01.2024;1;33
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";26.01.2024;2;22
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";26.01.2024;1;8
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";27.01.2024;0;33
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";27.01.2024;3;19
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";27.01.2024;3;25
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";28.01.2024;2;31
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";28.01.2024;7;52
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";28.01.2024;0;25
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";29.01.2024;5;26
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";29.01.2024;5;47
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";29.01.2024;1;24
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";30.01.2024;4;22
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";30.01.2024;7;40
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";30.01.2024;0;24
SMONN0-000246;147889 Сироп ”Блю Кюрасао” «Монин», стекло, 1л;Сироп;СБ;"{""цвет"":""синий"",""вкус"":""сладкий""}";31.01.2024;2;20
AST000-000004;СТАКАН "HUHTAMAKI" 200МЛ SP9;Посуда;Одноразовая;"{""цвет"":""белый"",""материал"":""пластик"",""размер"":""маленький""}";31.01.2024;1;39
CIMPCH-000114;КОФЕ DIM ARABICA CREAM, 1КГ;Кофе;Зерновой;"{""сорт"":""Арабика""}";31.01.2024;2;22
"""

# загрузим
df = pd.read_csv(StringIO(csv_data), sep=';', dayfirst=True, parse_dates=['Date'])

# распарсим ProductProperties JSON в колонки
def parse_props(s):
    try:
        return json.loads(s)
    except Exception:
        # попытка заменить неправильные кавычки
        try:
            s2 = s.replace("“", '"').replace("”", '"').replace("«", '"').replace("»", '"')
            return json.loads(s2)
        except Exception:
            return {}

props_df = df['ProductProperties'].apply(lambda s: pd.Series(parse_props(s)))
# стандартизируем имена колонок: русские названия оставляем как есть
df = pd.concat([df, props_df], axis=1)

# календарные признаки
df['day_of_week'] = df['Date'].dt.weekday  # 0=Mon
df['is_weekend'] = df['day_of_week'].isin([5,6]).astype(int)
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

# сорим и делаем лаги/скользящие
df = df.sort_values(['Article','Date']).reset_index(drop=True)
group = df.groupby('Article', as_index=False, sort=False)

# лаги для Sold
# --- PATCH START: исправленная секция лагов/роулингов/рестоков ---
# приводим типы и сортируем (важно)
df['Date'] = pd.to_datetime(df['Date'], dayfirst=True, errors='coerce')
df['Sold'] = pd.to_numeric(df['Sold'], errors='coerce').fillna(0).astype(float)
df['Stock'] = pd.to_numeric(df['Stock'], errors='coerce').fillna(0).astype(float)

df = df.sort_values(['Article', 'Date']).reset_index(drop=True)

# лаги для Sold (без reset_index, через groupby.shift)
df['sold_lag1']  = df.groupby('Article')['Sold'].shift(1).fillna(0)
df['sold_lag7']  = df.groupby('Article')['Sold'].shift(7).fillna(0)
df['sold_lag14'] = df.groupby('Article')['Sold'].shift(14).fillna(0)
df['sold_lag28'] = df.groupby('Article')['Sold'].shift(28).fillna(0)

# скользящие средние — через transform (гарантированно Series той же длины)
df['sold_ma7']  = df.groupby('Article')['Sold'].transform(lambda x: x.rolling(7,  min_periods=1).mean())
df['sold_ma14'] = df.groupby('Article')['Sold'].transform(lambda x: x.rolling(14, min_periods=1).mean())

# лаги для Stock и признаки рестока
df['stock_lag1'] = df.groupby('Article')['Stock'].shift(1)
df['stock_lag1'] = df['stock_lag1'].fillna(df['Stock'])  # для первого дня оставим текущее (можно заменить на NaN)
df['stock_diff'] = df['Stock'] - df['stock_lag1']
df['restock_flag'] = (df['stock_diff'] > 0).astype(int)

# days_since_last_restock: аккуратно возвращаем Series с тем же индексом
def days_since_last_restock(g):
    last = None
    out = []
    for idx, row in g.iterrows():
        if row.get('restock_flag', 0) == 1:
            last = row['Date']
            out.append(0)
        else:
            out.append(None if last is None else (row['Date'] - last).days)
    return pd.Series(out, index=g.index)

df['days_since_last_restock'] = None

for article, g in df.groupby('Article', sort=False):
    last = None
    # g уже отсортирована по Date, т.к. ранее мы отсортировали df
    for idx, row in g.iterrows():
        if row.get('restock_flag', 0) == 1:
            last = row['Date']
            df.at[idx, 'days_since_last_restock'] = 0
        else:
            df.at[idx, 'days_since_last_restock'] = None if last is None else (row['Date'] - last).days

# Сохраняем в текущую директорию (Windows-compatible) — поменяй путь, если хочешь в конкретную папку
import os
out_path = os.path.join(os.getcwd(), 'expanded_jan2024.csv')  # -> C:\OSPanel\domains\Etna_test\expanded_jan2024.csv
df.to_csv(out_path, index=False, sep=';')
print(f"Saved: {out_path}")

# покажем первые 20 строк
import caas_jupyter_tools as cjt
cjt.display_dataframe_to_user("expanded_jan2024_preview", df.head(20))

out_path

